{
  "</think>": 146238,
  "</tool_call>": 146228,
  "</tool_response>": 146236,
  "<think>": 146237,
  "<tool_call>": 146227,
  "<tool_response>": 146235,
  "<|box_end|>": 146219,
  "<|box_start|>": 146218,
  "<|endoftext|>": 146213,
  "<|file_sep|>": 146234,
  "<|fim_middle|>": 146230,
  "<|fim_pad|>": 146232,
  "<|fim_prefix|>": 146229,
  "<|fim_suffix|>": 146231,
  "<|free_token10|>": 146248,
  "<|free_token11|>": 146249,
  "<|free_token12|>": 146250,
  "<|free_token13|>": 146251,
  "<|free_token14|>": 146252,
  "<|free_token15|>": 146253,
  "<|free_token16|>": 146254,
  "<|free_token17|>": 146255,
  "<|free_token18|>": 146256,
  "<|free_token19|>": 146257,
  "<|free_token1|>": 146239,
  "<|free_token20|>": 146258,
  "<|free_token21|>": 146259,
  "<|free_token2|>": 146240,
  "<|free_token3|>": 146241,
  "<|free_token4|>": 146242,
  "<|free_token5|>": 146243,
  "<|free_token6|>": 146244,
  "<|free_token7|>": 146245,
  "<|free_token8|>": 146246,
  "<|free_token9|>": 146247,
  "<|im_end|>": 146215,
  "<|im_start|>": 146214,
  "<|image_pad|>": 146225,
  "<|object_ref_end|>": 146217,
  "<|object_ref_start|>": 146216,
  "<|quad_end|>": 146221,
  "<|quad_start|>": 146220,
  "<|repo_name|>": 146233,
  "<|video_pad|>": 146226,
  "<|vision_end|>": 146223,
  "<|vision_pad|>": 146224,
  "<|vision_start|>": 146222
}
